controllers/PenulisController.php

    public function actionCreate()
    {
        $model = new Penulis();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `penulis` (`nama`, `id_jenis_kelamin`, `alamat`) VALUES ('Syarif Hidayat', 2, 'Jl. AntaFani')

    protected function findModel($id)
    {
        if (($model = Penulis::findOne($id)) !== null) {
---
SELECT * FROM `penulis` WHERE `id`='3'