models/Buku.php

SELECT * FROM `buku`
---
    public static function getListBuku()
    {
        return ArrayHelper::map(Buku::find()->all(), 'id', 'nama');