models/JenisKelamin.php

    public static function getList()
    {
        return ArrayHelper::map(JenisKelamin::find()->all(), 'id', 'nama');
---
SELECT * FROM `jenis_kelamin`