models/User.php

SELECT * FROM `user`
---
    public function getListUser()
    {
        return ArrayHelper::map(User::find()->all(), 'id', 'nama');